Creates a new instance of a reference array.
  Namespace:   Autodesk.Revit.Creation
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ReferenceArray NewReferenceArray()
  Visual Basic
Public Function NewReferenceArray As ReferenceArray
  Visual C++
public:
ReferenceArray^ NewReferenceArray()
 See Also
  Application Class
  Autodesk.Revit.Creation Namespace